{"title":"Cequence Security Dashboard v1","description":"## Title\n\nDescribe this dashboard. Add links to other dashboards, monitors, wikis,  and docs to help your teammates. Markdown is supported.\n\n- [This might link to a dashboard](#)\n- [This might link to a wiki](#)","widgets":[{"id":1126467942733418,"definition":{"title":"7 Day Review","background_color":"vivid_blue","show_title":true,"type":"group","layout_type":"ordered","widgets":[{"id":4396980220198510,"definition":{"type":"image","url":"https://www.cequence.ai/wp-content/themes/cequence/dist/images/logos/cequence_logo.svg","url_dark_theme":"https://www.cequence.ai/wp-content/themes/cequence/dist/images/icon/white_cequence_logo.svg","sizing":"contain","margin":"md","has_background":false,"has_border":false,"vertical_align":"center","horizontal_align":"center"},"layout":{"x":0,"y":0,"width":12,"height":5}},{"id":5815234272896646,"definition":{"title":"Total Transaction Count","title_size":"16","title_align":"left","time":{},"type":"query_value","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":""},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[],"storage":"hot"}]}],"autoscale":true,"precision":2},"layout":{"x":0,"y":5,"width":6,"height":4}},{"id":8732889501292768,"definition":{"title":"Total Sentinel Transaction Count","title_size":"16","title_align":"left","type":"query_value","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"host:* @risk_score_array:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[]}]}],"autoscale":true,"precision":2},"layout":{"x":6,"y":5,"width":6,"height":4}},{"id":5097794378932148,"definition":{"title":"Total UAP Transaction Count","title_size":"16","title_align":"left","time":{},"type":"query_value","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":""},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[],"storage":"hot"}]}],"autoscale":true,"precision":2},"layout":{"x":0,"y":9,"width":4,"height":4}},{"id":1134110677927402,"definition":{"title":"Total Mitigated Traffic","title_size":"16","title_align":"left","type":"query_value","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":"@action:*"},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[],"storage":"hot"}]}],"autoscale":true,"precision":2},"layout":{"x":4,"y":9,"width":4,"height":4}},{"id":8403674416000294,"definition":{"title":"Percent Malicious Traffic","title_size":"16","title_align":"left","time":{},"type":"query_value","requests":[{"formulas":[{"formula":"query1 / query2 * 100"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":"@action:*"},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[],"storage":"hot"},{"data_source":"logs","name":"query2","search":{"query":""},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[],"storage":"hot"}]}],"autoscale":true,"custom_unit":"%","precision":2},"layout":{"x":8,"y":9,"width":4,"height":4}},{"id":7888854269886798,"definition":{"title":"Origin ISP","title_size":"16","title_align":"left","type":"toplist","requests":[{"formulas":[{"formula":"query1","limit":{"count":50,"order":"desc"}}],"response_format":"scalar","queries":[{"search":{"query":"@isp:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@isp","sort":{"aggregation":"count","order":"desc"},"limit":50}]}]}]},"layout":{"x":0,"y":13,"width":5,"height":6}},{"id":2753536009542442,"definition":{"title":"Hosts","type":"treemap","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"host:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":50}]}]}]},"layout":{"x":5,"y":13,"width":7,"height":6}}]},"layout":{"x":0,"y":0,"width":12,"height":20}},{"id":675546224364998,"definition":{"title":"Attack Detection","background_color":"blue","show_title":true,"type":"group","layout_type":"ordered","widgets":[{"id":6598800404788067,"definition":{"title":"Global Heat Map","title_size":"16","title_align":"left","type":"geomap","requests":[{"formulas":[{"formula":"query1","limit":{"count":1000,"order":"desc"}}],"response_format":"scalar","queries":[{"search":{"query":"@country:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@country","sort":{"aggregation":"count","order":"desc"},"limit":1000}]}]}],"style":{"palette":"YlOrRd","palette_flip":false},"view":{"focus":"WORLD"}},"layout":{"x":0,"y":0,"width":12,"height":5}},{"id":5115876064071160,"definition":{"title":"Traffic Volume by Country Top List","title_size":"16","title_align":"left","type":"query_table","requests":[{"formulas":[{"alias":"Volume","conditional_formats":[],"cell_display_mode":"bar","formula":"query1","limit":{"count":50,"order":"desc"}},{"alias":"Volume Mitigated","cell_display_mode":"bar","formula":"query3"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":""},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[{"facet":"@country","limit":50,"sort":{"aggregation":"count","order":"desc"}}],"storage":"hot"},{"data_source":"logs","name":"query3","search":{"query":"@action:*"},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[{"facet":"@country","limit":50,"sort":{"aggregation":"count","order":"desc"}}],"storage":"hot"}]}]},"layout":{"x":0,"y":5,"width":12,"height":5}},{"id":3882471095456300,"definition":{"title":"Risk Categories","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@risk_category:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@risk_category","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}],"type":"sunburst"},"layout":{"x":0,"y":10,"width":12,"height":5}},{"id":720810645313490,"definition":{"title":"User Agents","title_size":"16","title_align":"left","type":"toplist","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@user_agent:*"},"data_source":"logs","compute":{"interval":20000,"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@user_agent","sort":{"aggregation":"count","order":"desc"},"limit":10}]},{"search":{"query":"@header_value_user_agent:*"},"data_source":"logs","compute":{"interval":20000,"aggregation":"count"},"name":"query2","indexes":["*"],"group_by":[{"facet":"@header_value_user_agent","sort":{"aggregation":"count","order":"desc"},"limit":10}]}]}]},"layout":{"x":0,"y":15,"width":6,"height":4}},{"id":4561085588775930,"definition":{"title":"Projected Browser (5x only)","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":"@projected_browser:*"},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[{"facet":"@projected_browser","limit":1000,"sort":{"aggregation":"count","order":"desc"}}],"storage":"hot"}]}],"type":"sunburst"},"layout":{"x":6,"y":15,"width":6,"height":4}},{"id":1932193744467414,"definition":{"title":"Usernames","title_size":"16","title_align":"left","time":{"live_span":"15m"},"requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@username:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@username","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}],"type":"sunburst"},"layout":{"x":0,"y":19,"width":12,"height":5}}]},"layout":{"x":0,"y":20,"width":12,"height":25}},{"id":6492935583409288,"definition":{"title":"Native Mitigation","background_color":"vivid_blue","show_title":true,"type":"group","layout_type":"ordered","widgets":[{"id":6605556127894706,"definition":{"title":"Mitigation Events","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@action:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@action","sort":{"aggregation":"count","order":"desc"},"limit":10},{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":10}]}]}],"type":"sunburst"},"layout":{"x":0,"y":0,"width":12,"height":5}},{"id":6004393978580972,"definition":{"title":"Fingerprint & Confidence Score (5x only)","title_size":"16","title_align":"left","type":"query_table","requests":[{"formulas":[{"cell_display_mode":"bar","formula":"query1","limit":{"count":1000,"order":"desc"}}],"response_format":"scalar","queries":[{"data_source":"logs","name":"query1","search":{"query":""},"indexes":["*"],"compute":{"aggregation":"count"},"group_by":[{"facet":"host","limit":10,"sort":{"aggregation":"count","order":"desc"}},{"facet":"@confidence_score","limit":10,"sort":{"aggregation":"count","order":"desc"}},{"facet":"@http_fingerprint","limit":10,"sort":{"aggregation":"count","order":"desc"}}],"storage":"hot"}]}]},"layout":{"x":0,"y":5,"width":6,"height":5}},{"id":3998628095419350,"definition":{"title":"Fingerprint & Confidence Score","title_size":"16","title_align":"left","type":"query_table","requests":[{"formulas":[{"formula":"query1","cell_display_mode":"bar","limit":{"count":1000,"order":"desc"}}],"response_format":"scalar","queries":[{"search":{"query":""},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":10},{"facet":"@confidence","sort":{"aggregation":"count","order":"desc"},"limit":10},{"facet":"@fingerprint","sort":{"aggregation":"count","order":"desc"},"limit":10}]}]}]},"layout":{"x":6,"y":5,"width":6,"height":5}},{"id":1660742579487320,"definition":{"title":"Log Count by Policy Name","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"a"}],"response_format":"scalar","queries":[{"search":{"query":"@policy.name:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"a","indexes":["*"],"group_by":[{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"@policy.name","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}],"type":"sunburst"},"layout":{"x":0,"y":10,"width":12,"height":5}},{"id":6684615690827674,"definition":{"title":"Log Count by Rule ID","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"a"}],"response_format":"scalar","queries":[{"search":{"query":""},"data_source":"logs","compute":{"aggregation":"count"},"name":"a","indexes":["*"],"group_by":[{"facet":"@rule_id_array","sort":{"aggregation":"count","order":"desc"},"limit":10},{"facet":"@Botdefense_rule_id_array","sort":{"aggregation":"count","order":"desc"},"limit":10},{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":10}]}]}],"type":"sunburst"},"layout":{"x":0,"y":15,"width":12,"height":5}}]},"layout":{"x":0,"y":45,"width":12,"height":21,"is_column_break":true}},{"id":290500507506424,"definition":{"title":"API Cataloging","background_color":"blue","show_title":true,"type":"group","layout_type":"ordered","widgets":[{"id":431357784692002,"definition":{"title":"Sentinel API Path","title_size":"16","title_align":"left","type":"query_table","requests":[{"formulas":[{"formula":"query1","cell_display_mode":"bar","limit":{"count":900,"order":"desc"}}],"response_format":"scalar","queries":[{"search":{"query":""},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@path","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"@risk_score_array","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}]},"layout":{"x":0,"y":0,"width":6,"height":5}},{"id":2874640282076077,"definition":{"title":"UAP URI Path","title_size":"16","title_align":"left","type":"toplist","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@uri:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":50},{"facet":"@uri","sort":{"aggregation":"count","order":"desc"},"limit":50}]}]}]},"layout":{"x":6,"y":0,"width":6,"height":5}}]},"layout":{"x":0,"y":66,"width":12,"height":6}},{"id":1298060318728618,"definition":{"title":"API Risk Compliance","background_color":"vivid_blue","show_title":true,"type":"group","layout_type":"ordered","widgets":[]},"layout":{"x":0,"y":72,"width":12,"height":1}},{"id":6391920936179150,"definition":{"title":"Risk Contributors","title_size":"16","title_align":"left","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":""},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"@risk_contributor","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}],"type":"sunburst"},"layout":{"x":0,"y":0,"width":12,"height":5}},{"id":3652321744608392,"definition":{"title":"Response Code","type":"treemap","requests":[{"formulas":[{"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":"@response_code:*"},"data_source":"logs","compute":{"aggregation":"count"},"name":"query1","indexes":["*"],"group_by":[{"facet":"host","sort":{"aggregation":"count","order":"desc"},"limit":30},{"facet":"@response_code","sort":{"aggregation":"count","order":"desc"},"limit":30}]}]}]},"layout":{"x":0,"y":5,"width":12,"height":4}},{"id":5610411990720160,"definition":{"title":"Risk Category Score","title_size":"16","title_align":"left","type":"query_table","requests":[{"formulas":[{"alias":"Risk Score Average","cell_display_mode":"bar","limit":{"count":10,"order":"desc"},"conditional_formats":[{"palette":"red_on_white","comparator":">","value":7},{"palette":"yellow_on_white","comparator":">","value":4},{"palette":"green_on_white","comparator":"<=","value":3}],"formula":"query1"}],"response_format":"scalar","queries":[{"search":{"query":""},"data_source":"logs","compute":{"metric":"@risk_category_score","aggregation":"avg"},"name":"query1","indexes":["*"],"group_by":[{"facet":"host","sort":{"metric":"@risk_category_score","aggregation":"avg","order":"desc"},"limit":10}]}]}]},"layout":{"x":0,"y":9,"width":12,"height":5}}],"template_variables":[],"layout_type":"ordered","notify_list":[],"reflow_type":"fixed","id":"am3-54h-hx6"}
